{
  "2017s": {
    "roman": "XV",
    "link": "http://2017w.pennapps.com",
    "full": "Spring 2017",
    "short": "Hackers and Penguins went to the stars for this winter PennApps.",
    "longHTML": "PennApps XV took its participants to the stars, marrying the brand-new space theme with the traditional penguins. It also doubled down on its educational efforts, bringing back <a href='http://dinphil.github.io/code-weekend'>Code Weekend</a> and partnering with <a href='https://hack4impact.org/'>Hack4Impact</a>, <a href-'https://willowtreeapps.com/'>WillowTree</a>, <a href='http://www.joinhorizons.com/'>Horizons</a>, <a href='https://www.samhsa.gov/'>SAMHSA</a>, <a href='http://drf.vc'>Dorm Room Fund</a>, and <a href='https://www.yellowdig.com/'>Yellowdig</a>. They also increased the focus on healthy hacking by having group yoga and a 5K run. The hackers finally congregated in Houston Hall to show off what they built. You can find all the hacks <a href='https://pennapps-xv.devpost.com/'>here</a>."
  },
  "2016f": {
    "roman": "XIV",
    "link": "http://2016f.pennapps.com",
    "full": "Fall 2016",
    "short": "An intensified focus on the basics defined this PennApps.",
    "longHTML": "PennApps XIV doubled down the the basics of the hackathon and perfected it. PennApps brought back the Health Forum to provide hackers with the best resources to improve the healthcare industry. This ranged from partnerships with <a href='https://hack4impact.org/'>Hack4Impact</a>, <a href-'https://willowtreeapps.com/'>WillowTree</a>, <a href='http://www.joinhorizons.com/'>Horizons</a>, and <a href='http://drf.vc'>Dorm Room Fund</a> to exciting side events like a 5K run, mini-hackathons, and Code Fights, to continuing to improve the Hacker Guru Program. You can find all the hacks <a href='https://pennapps-xiv.devpost.com/'>here</a>."
  },
  "2016s": {
    "roman": "XIII",
    "link": "http://2016s.pennapps.com",
    "full": "Spring 2016",
    "short": "This PennApps redefined access to hackathons with the Hacker Guru Program.",
    "longHTML": "With PennApps XIII we decided to try something different. With a greater focus on education & learning, we turned the spotlight to our brand new take on mentorship: Hacker Gurus. Hackers could apply to put their considerable hackathon experience to good use by joining teams of first-time hackers to help guide them through the weekend. With over 70 Hacker Gurus, our experiment was a success, with <a href='http://devpost.com/software/audsearch'>Audsearch</a> winning the prize for the best Hacker Guru-led Team! Despite holding PennApps in the middle of a blizzard, we were able to hold many more workshops than in previous years and achieve an impressive turnout! Delicious food (including SugarPhilly and DiAntonio’s, two local standouts) and adorable penguin plushies (among tons of other swag) awaited our hackers. The Final Expo involved hundreds of teams, with amazing hacks from humor to VR/AR to health! In the end, <a href='http://devpost.com/software/ramear'>RAMear</a> stole the show with their first-place hack that transmits data between computers via RF signals. Check out our other awesome submissions <a href='http://pennapps-xiii.devpost.com/submissions'>here</a>!"
  },
  "2015f": {
    "roman": "XII",
    "link": "http://2015f.pennapps.com",
    "full": "Fall 2015",
    "short": "Over 2200 people in the Wells Fargo Center - the world's largest college hackathon.",
    "longHTML": "PennApps XII broke all boundaries, admitting over 2000 hackers and taking place in the Wells Fargo Center. With a greater focus on community, students from schools around the Philadelphia area were automatically admitted allowing more students to enjoy the hackathon experience. The weekend was full of different workshops and meetups for hackers to discover more about the tech and hacking world. This PennApps also marked the beginning of Routes - themes that hackers could incorporate into their hack and that were showcased in different forms over the course of the weekend. The Civic Hacking Route, in collaboration with the City of Philadelphia and Code for Philly started a new PennApps tradition in hacking for social good. Great food and swag (including the platypus plushies everyone received at check in) were provided throughout the event. The Final Expo was on the main court and had to be split into two stages so all the participants could show off their finished hacks. In the end, <a href='http://devpost.com/software/brailleware'>FifthSense</a> took first prize at the event. Check out the other awesome submissions <a href='http://pennappsxii.devpost.com/submissions'>here</a>."
  },
  "2015s": {
    "roman": "XI",
    "link": "http://2015s.pennapps.com",
    "full": "Spring 2015",
    "short": "Penguins took over this winter edition of PennApps.",
    "longHTML": "PennApps Winter 2015: PennApps XI was winter themed, and brought out the big guns with the first penguin-themed hackathon. The biggest PennApps yet, with over 1300 hackers, focused on making the most enjoyable hackathon for hackers, with great food (local delicacies such as Federal Donuts, Rita's, and Philly Cheesesteaks were standouts), great side events (Ice Skating with the penguin mascot) and penguin plushies for everyone. We also brought back <a href='http://dinphil.github.io/code-weekend'>Code Weekend</a> and all-new workshops and <a href='mentoring.pennapps.com'>mentors</a> as resources to help hackers get started. The Final Expo moved to the historic Houston Hall and a joint Live Stream with MHacks took over the front page of Twitch.tv. The winning team <a href='http://challengepost.com/software/lifesaber'>lifesaber</a> was from Barcelona and the rest of the hacks can be seen <a href='http://pennapps2015w.challengepost.com/submissions'>here</a>."
  },
  "2014f": {
    "roman": "X",
    "link": "http://2014f.pennapps.com",
    "full": "Fall 2014",
    "short": "The tenth anniversary of the original college hackathon.",
    "longHTML": "PennApps X was the best PennApps yet, with incredible cutting edge hardware on hand, collaborations with Penn's Med &amp; Design Schools and amazing hacks by the best hackers from around the world. With only a 30% acceptance rate, it was also the most competitive PennApps ever. We focused on making the experience for hackers as great as possible by doubling down on our mentoring efforts and organizing <a href='http://dinphil.github.io/code-weekend/'>Code Weekend</a> the weekend before PennApps to introduce first-time hackers to coding. We also brought in the team from <a href='http://www.pagevamp.com/'>Pagevamp</a> (PennApps Fall 2012) to inspire hackers to build things that last. PennApps X - Fall 2014 was a major milestone for the hacker community, and we celebrated with special X themed gear, cakes and swag for the ages."
  },
  "2014s": {
    "roman": "IX",
    "link": "http://2014s.pennapps.com",
    "full": "Spring 2014",
    "short": "PennApps Valentines Day edition was the most loving yet.",
    "longHTML": "Instead of increasing our size, we expressed our love for PennApps participants by focusing on improving the quality of the hacking experience for our Valentine’s day edition. We helped hackers express admiration for each other through candygrams and our <a href='http://www.facebook.com/pennappsadmirers'>PennApps Admirers</a> page, honored the youngest elite coders with a <a href='http://technical.ly/philly/2014/02/21/pennapps-high-schoolers/'>high school hacker meet-up</a>, and cherished our top sponsor Venmo with a parody ad campaign. We joined forces with Penn’s Architechs to provide dedicated space and parts to hardware hackers and Penn’s Design and Education schools for <a href='http://technical.ly/philly/2014/02/21/pennapps-high-schoolers/'>Stitchfest</a>. After hacking for 36 hours straight in the Penn Engineering complex and demoing finished apps at the Penn Museum, <a href='http://pennapps2014s.challengepost.com/submissions/20855-the-homework-machine'>The Homework Machine</a> took the top prize (and you can find all the other awesome projects <a href='http://pennapps2014s.challengepost.com/submissions'>here</a>)."
  },
  "2013f": {
    "roman": "VIII",
    "link": "",
    "full": "Fall 2013",
    "short": "Over 1100 students made this the first college hackathon over 1000.",
    "longHTML": "With around 1,100 students, we nearly tripled in size this time around. Sponsors including Venmo, Microsoft, Amazon Web Services, and Google Cloud Platform allowed the best hackers to travel to Penn from around the world, including Switzerland (ETH Zurich), Hong Kong (HKUST), Israel (IDC Herzliya), and Singapore (NUS). We took over Penn Engineering and the sixth floor of Van Pelt library for hacking, and the Palestra on Sunday for an expo of the more than 200 incredible hacks. First place and $10,000 went to <a href='http://pennapps.challengepost.com/submissions/17189-swap/'>Swap</a> and you can find the rest of the outstanding hacks <a href='http://pennapps.challengepost.com/submissions/'>here</a>."
  },
  "2013s": {
    "roman": "VII",
    "link": "",
    "full": "Spring 2013",
    "short": "Five-hundred students from around the world attended the largest PennApps yet.",
    "longHTML": "With nearly 500 students, PennApps continued to hold its title as the top college hackathon. With Venmo, Dropbox, Microsoft, Andreessen Horowitz, and many other companies sponsoring, PennApps Spring 2013 was able to attract students from universities as far off as California (Stanford, Berkeley, etc.), Canada (Waterloo, Toronto) and even Switzerland (ETH Zurich), becoming the first PennApps to go international. First place went to <a href='https://www.hackerleague.org/hackathons/pennapps-spring-2013/hacks/inventory'>Inventory</a> and the rest of the winners can be found <a href='http://2013s.pennapps.com/prizes/'>here</a>."
  },
  "2012f": {
    "roman": "VI",
    "link": "",
    "full": "Fall 2012",
    "short": "Over 300 students attended, more than double previous events.",
    "longHTML": "Over 300 people attended, more than double that of previous events. Sponsored by Venmo, Bain Capital Ventures, KPCB, and many more, PennApps 2012 Fall managed to churn out a future member of the YC '13 class, <a href='http://www.paytango.com/'>PayTango</a>. Despite fierce competition, <a href='http://www.pennapps.jocelinlee.com/#&amp;panel1-1'>Java Auto Music</a> won first place with the <a href='http://blog.pennapps.com/post/31797542186/pennapps-winners'>rest of the winners</a> being just as impressive."
  },
  "2012s": {
    "roman": "V",
    "link": "",
    "full": "Spring 2012",
    "short": "Forty-two teams competed in this event focused on 'Simplicity'.",
    "longHTML": "Sponsored by Venmo, Coursekit (now Lore), Tumblr, Yahoo, and nineteen other companies, PennApps Spring 2012 centered around the theme of simplicity. <a href='https://www.youtube.com/watch?v=m33PqhdDl0M&amp;feature=plcp&amp;context=C38b45d6UDOEgsToPDskIpt5vtYUlhubu8UT-6LMdj'>ScratchTable</a> won the grand prize: the team used a contact mike and their coding skills to turn any surface into a DJ turntable. Second place was <a href='http://grassroutes.us'>Grassroutes</a>, a hack that allowed anyone to put a widget on any website, giving users one-click access to their congressional representatives. All of the other winners can be found <a href='http://pennapps12s.tumblr.com/post/16264210294/congratulations-to-the-winners'>here</a>."
  },
  "2011f": {
    "roman": "IV",
    "link": "http://2011f.pennapps.com",
    "full": "Fall 2011",
    "short": "'PennApps Data', with 40 teams.",
    "longHTML": "In Fall 2011, the focus was data. Sponsored by Venmo, Comcast, Twilio, Yahoo, Palantir, Tumblr, Mozilla, and 30 other companies and organizations, we challenged students to choose from a variety of publicly available data sets. Competitors were asked to uniquely and efficiently solve problems through the use of data. 40 teams presented at the demo session, and <a href='http://2014s.pennapps.com/'>their hacks</a> were truly innovative as were the <a href='http://2011f.pennapps.com/blog/2011/9/18/congratulations-to-the-winners.html'>winners</a>."
  },
  "2011s": {
    "roman": "III",
    "link": "",
    "full": "Spring 2011",
    "short": "Known as 'PennApps Mobile', with 23 teams.",
    "longHTML": "Also known as PennApps mobile, this hackathon centered around the creation of mobile apps. 23 teams pulled together their hacks on platforms including Android, iPhone, Mobile Web, Windows Phone, and through texting."
  },
  "2010f": {
    "roman": "II",
    "link": "",
    "full": "Fall 2010",
    "short": "The first 48-hour PennApps",
    "longHTML": "This was the first 48 hour PennApps; though only 10 teams made it through, we think they did an amazing job! One standout app was <a href='http://www.septanow.org/'>SEPTA Now,</a> which tracks SEPTA regional trains around the city so users can know exactly where trains are and if they're running late."
  },
  "2009f": {
    "roman": "I",
    "link": "",
    "full": "Fall 2009",
    "short": "The original PennApps, with 17 teams",
    "longHTML": "Cohosted by Penn's Women in Computer Science (WICS), the very first PennApps spanned a week! (Don't worry, participants were allowed to sleep.) 17 teams participated, and laid the foundation for all PennApps to come."
  }
}